# DATA CREATION

In [213]:
import numpy as np
import pandas as pd

labels = ['a','b','@']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}

print ("Labels:", labels)
print("My data:", my_data)
print("Dictionary:", d)

Labels: ['a', 'b', '@']
My data: [10, 20, 30]
Dictionary: {'a': 10, 'b': 20, 'c': 30}

In [214]:
pd.Series([10,20,30])

0    10
1    20
2    30
dtype: int64

In [215]:
pd.Series(labels,my_data)

10    a
20    b
30    @
dtype: object

In [216]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [217]:
pd.Series(labels)

0    a
1    b
2    @
dtype: object

In [218]:
pd.Series(data=[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [219]:
ser1 = pd.Series(data=[1,2,3,4])

ser1

0    1
1    2
2    3
3    4
dtype: int64

In [220]:
we= pd.Series([10,20,30])
we

0    10
1    20
2    30
dtype: int64

In [221]:
ser1 = pd.Series(data=[1,2,3,4],index=['CA', 'OR', 'CO', 'AZ'])
ser1

CA    1
OR    2
CO    3
AZ    4
dtype: int64

In [409]:
ser2 = pd.Series([1,2,5,4],['CA', 'OR', "NY", 'AZ'])
ser2

CA    1
OR    2
NY    5
AZ    4
dtype: int64

In [411]:
ser2[2]

5

In [223]:
ser123=pd.Series([10,20,30])
ser123

0    10
1    20
2    30
dtype: int64

In [224]:
ser1[0]

1

In [225]:
ser1['AZ']

4

In [226]:
ser2['NY']

5

In [227]:
 ser2[0]

1

In [228]:
ser2["CA"]

1

In [229]:

 ser1[1:]

OR    2
CO    3
AZ    4
dtype: int64

In [230]:
ser1 = pd.Series([1,2,3,4],['CA', 'OR', 'CO', 'AZ'])
ser2 = pd.Series([1,2,5,4],['CA', 'OR', 'NV', 'AZ'])
ser3 = ser1+ser2
ser3

AZ    8.0
CA    2.0
CO    NaN
NV    NaN
OR    4.0
dtype: float64

In [231]:
ser1*ser2

AZ    16.0
CA     1.0
CO     NaN
NV     NaN
OR     4.0
dtype: float64

In [232]:
from numpy.random import randn as rn

matrix_data = rn(5,4)

matrix_data

array([[ 1.61898166,  1.54160517, -0.25187914, -0.84243574],
       [ 0.18451869,  0.9370822 ,  0.73100034,  1.36155613],
       [-0.32623806,  0.05567601,  0.22239961, -1.443217  ],
       [-0.75635231,  0.81645401,  0.75044476, -0.45594693],
       [ 1.18962227, -1.69061683, -1.35639905, -1.23243451]])

In [233]:
from numpy.random import randn as rn
np.random.seed(100)
matrix_data = rn(5,4)

matrix_data

array([[-1.74976547,  0.3426804 ,  1.1530358 , -0.25243604],
       [ 0.98132079,  0.51421884,  0.22117967, -1.07004333],
       [-0.18949583,  0.25500144, -0.45802699,  0.43516349],
       [-0.58359505,  0.81684707,  0.67272081, -0.10441114],
       [-0.53128038,  1.02973269, -0.43813562, -1.11831825]])

In [234]:
row_labels = ['A','B','C','D','E']
column_headings = ['W','X','Y','Z']

df = pd.DataFrame(data=matrix_data, index=row_labels, columns=column_headings)
df

          W         X         Y         Z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
C -0.189496  0.255001 -0.458027  0.435163
D -0.583595  0.816847  0.672721 -0.104411
E -0.531280  1.029733 -0.438136 -1.118318

In [235]:
type(df)

pandas.core.frame.DataFrame

In [236]:
df[["X","Y"]]

          X         Y
A  0.342680  1.153036
B  0.514219  0.221180
C  0.255001 -0.458027
D  0.816847  0.672721
E  1.029733 -0.438136

In [237]:
 type(df[["X","Y"]])

pandas.core.frame.DataFrame

In [238]:
df

          W         X         Y         Z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
C -0.189496  0.255001 -0.458027  0.435163
D -0.583595  0.816847  0.672721 -0.104411
E -0.531280  1.029733 -0.438136 -1.118318

In [239]:
df["Z"]=df["X"]+df["Y"]

In [240]:
df

          W         X         Y         Z
A -1.749765  0.342680  1.153036  1.495716
B  0.981321  0.514219  0.221180  0.735399
C -0.189496  0.255001 -0.458027 -0.203026
D -0.583595  0.816847  0.672721  1.489568
E -0.531280  1.029733 -0.438136  0.591597

In [241]:
df["new"]=df["X"]+df["Y"]

In [242]:
df

          W         X         Y         Z       new
A -1.749765  0.342680  1.153036  1.495716  1.495716
B  0.981321  0.514219  0.221180  0.735399  0.735399
C -0.189496  0.255001 -0.458027 -0.203026 -0.203026
D -0.583595  0.816847  0.672721  1.489568  1.489568
E -0.531280  1.029733 -0.438136  0.591597  0.591597

In [243]:
df["newsum"]=df["X"]+df["Z"]

In [244]:
df

          W         X         Y         Z       new    newsum
A -1.749765  0.342680  1.153036  1.495716  1.495716  1.838397
B  0.981321  0.514219  0.221180  0.735399  0.735399  1.249617
C -0.189496  0.255001 -0.458027 -0.203026 -0.203026  0.051976
D -0.583595  0.816847  0.672721  1.489568  1.489568  2.306415
E -0.531280  1.029733 -0.438136  0.591597  0.591597  1.621330

In [245]:
df.drop("new",axis=1)

          W         X         Y         Z    newsum
A -1.749765  0.342680  1.153036  1.495716  1.838397
B  0.981321  0.514219  0.221180  0.735399  1.249617
C -0.189496  0.255001 -0.458027 -0.203026  0.051976
D -0.583595  0.816847  0.672721  1.489568  2.306415
E -0.531280  1.029733 -0.438136  0.591597  1.621330

In [246]:
df

          W         X         Y         Z       new    newsum
A -1.749765  0.342680  1.153036  1.495716  1.495716  1.838397
B  0.981321  0.514219  0.221180  0.735399  0.735399  1.249617
C -0.189496  0.255001 -0.458027 -0.203026 -0.203026  0.051976
D -0.583595  0.816847  0.672721  1.489568  1.489568  2.306415
E -0.531280  1.029733 -0.438136  0.591597  0.591597  1.621330

In [247]:
df.drop("new",axis=1)

          W         X         Y         Z    newsum
A -1.749765  0.342680  1.153036  1.495716  1.838397
B  0.981321  0.514219  0.221180  0.735399  1.249617
C -0.189496  0.255001 -0.458027 -0.203026  0.051976
D -0.583595  0.816847  0.672721  1.489568  2.306415
E -0.531280  1.029733 -0.438136  0.591597  1.621330

In [248]:
df

          W         X         Y         Z       new    newsum
A -1.749765  0.342680  1.153036  1.495716  1.495716  1.838397
B  0.981321  0.514219  0.221180  0.735399  0.735399  1.249617
C -0.189496  0.255001 -0.458027 -0.203026 -0.203026  0.051976
D -0.583595  0.816847  0.672721  1.489568  1.489568  2.306415
E -0.531280  1.029733 -0.438136  0.591597  0.591597  1.621330

In [249]:
df

          W         X         Y         Z       new    newsum
A -1.749765  0.342680  1.153036  1.495716  1.495716  1.838397
B  0.981321  0.514219  0.221180  0.735399  0.735399  1.249617
C -0.189496  0.255001 -0.458027 -0.203026 -0.203026  0.051976
D -0.583595  0.816847  0.672721  1.489568  1.489568  2.306415
E -0.531280  1.029733 -0.438136  0.591597  0.591597  1.621330

In [250]:
df.drop(["ritesh","newsum"],axis=1)

KeyError: "['ritesh'] not found in axis"

In [251]:
df

          W         X         Y         Z       new    newsum
A -1.749765  0.342680  1.153036  1.495716  1.495716  1.838397
B  0.981321  0.514219  0.221180  0.735399  0.735399  1.249617
C -0.189496  0.255001 -0.458027 -0.203026 -0.203026  0.051976
D -0.583595  0.816847  0.672721  1.489568  1.489568  2.306415
E -0.531280  1.029733 -0.438136  0.591597  0.591597  1.621330

In [252]:
df=df.drop("newsum",axis=1)

In [253]:
df

          W         X         Y         Z       new
A -1.749765  0.342680  1.153036  1.495716  1.495716
B  0.981321  0.514219  0.221180  0.735399  0.735399
C -0.189496  0.255001 -0.458027 -0.203026 -0.203026
D -0.583595  0.816847  0.672721  1.489568  1.489568
E -0.531280  1.029733 -0.438136  0.591597  0.591597

In [254]:
df.drop(["D","A"])

          W         X         Y         Z       new
B  0.981321  0.514219  0.221180  0.735399  0.735399
C -0.189496  0.255001 -0.458027 -0.203026 -0.203026
E -0.531280  1.029733 -0.438136  0.591597  0.591597

In [255]:
df

          W         X         Y         Z       new
A -1.749765  0.342680  1.153036  1.495716  1.495716
B  0.981321  0.514219  0.221180  0.735399  0.735399
C -0.189496  0.255001 -0.458027 -0.203026 -0.203026
D -0.583595  0.816847  0.672721  1.489568  1.489568
E -0.531280  1.029733 -0.438136  0.591597  0.591597

In [256]:
df

          W         X         Y         Z       new
A -1.749765  0.342680  1.153036  1.495716  1.495716
B  0.981321  0.514219  0.221180  0.735399  0.735399
C -0.189496  0.255001 -0.458027 -0.203026 -0.203026
D -0.583595  0.816847  0.672721  1.489568  1.489568
E -0.531280  1.029733 -0.438136  0.591597  0.591597

# loc/iloc

In [257]:
df

          W         X         Y         Z       new
A -1.749765  0.342680  1.153036  1.495716  1.495716
B  0.981321  0.514219  0.221180  0.735399  0.735399
C -0.189496  0.255001 -0.458027 -0.203026 -0.203026
D -0.583595  0.816847  0.672721  1.489568  1.489568
E -0.531280  1.029733 -0.438136  0.591597  0.591597

In [258]:
df

          W         X         Y         Z       new
A -1.749765  0.342680  1.153036  1.495716  1.495716
B  0.981321  0.514219  0.221180  0.735399  0.735399
C -0.189496  0.255001 -0.458027 -0.203026 -0.203026
D -0.583595  0.816847  0.672721  1.489568  1.489568
E -0.531280  1.029733 -0.438136  0.591597  0.591597

In [259]:
df.loc[["A","B"],["X","Y"]]

          X         Y
A  0.342680  1.153036
B  0.514219  0.221180

In [260]:
wer=pd.Series([10,20,30,40,50,60])

In [261]:
wer

0    10
1    20
2    30
3    40
4    50
5    60
dtype: int64

In [262]:
wer.iloc[4]

50

In [263]:
wer1=pd.Series([1,2,3,4,5,6],[10,20,30,40,50,60])

In [264]:
wer1

10    1
20    2
30    3
40    4
50    5
60    6
dtype: int64

In [265]:
wer1.loc[50]

5

In [266]:
wer1.iloc[4]

5

In [267]:
wer1.iloc[3]

4

In [268]:
wer1.loc[10]

1

In [269]:
df

          W         X         Y         Z       new
A -1.749765  0.342680  1.153036  1.495716  1.495716
B  0.981321  0.514219  0.221180  0.735399  0.735399
C -0.189496  0.255001 -0.458027 -0.203026 -0.203026
D -0.583595  0.816847  0.672721  1.489568  1.489568
E -0.531280  1.029733 -0.438136  0.591597  0.591597

In [270]:
df>0

       W     X      Y      Z    new
A  False  True   True   True   True
B   True  True   True   True   True
C  False  True  False  False  False
D  False  True   True   True   True
E  False  True  False   True   True

In [271]:
df[df>0]

          W         X         Y         Z       new
A       NaN  0.342680  1.153036  1.495716  1.495716
B  0.981321  0.514219  0.221180  0.735399  0.735399
C       NaN  0.255001       NaN       NaN       NaN
D       NaN  0.816847  0.672721  1.489568  1.489568
E       NaN  1.029733       NaN  0.591597  0.591597

In [272]:
df

          W         X         Y         Z       new
A -1.749765  0.342680  1.153036  1.495716  1.495716
B  0.981321  0.514219  0.221180  0.735399  0.735399
C -0.189496  0.255001 -0.458027 -0.203026 -0.203026
D -0.583595  0.816847  0.672721  1.489568  1.489568
E -0.531280  1.029733 -0.438136  0.591597  0.591597

In [273]:
data=np.matrix("34,65,160;67,98,180;23,56,172;65,43,166;51,91,180")
labels=["a","b","c","d","e"]
col_head=["age","weight","height"]

In [274]:
data=pd.DataFrame(data,index=labels,columns=col_head)

In [275]:
data

   age  weight  height
a   34      65     160
b   67      98     180
c   23      56     172
d   65      43     166
e   51      91     180

In [276]:
data["height"]>166

a    False
b     True
c     True
d    False
e     True
Name: height, dtype: bool

In [277]:
data[data["height"]>166]

   age  weight  height
b   67      98     180
c   23      56     172
e   51      91     180

In [278]:
data[(data["height"]>166) & (data["weight"]>80)]

   age  weight  height
b   67      98     180
e   51      91     180

In [279]:
data.loc[(data["height"]>166) & (data["weight"]>80),["age","height"]]

   age  height
b   67     180
e   51     180

# Reset_index

In [280]:
data

   age  weight  height
a   34      65     160
b   67      98     180
c   23      56     172
d   65      43     166
e   51      91     180

In [281]:
data.reset_index()

  index  age  weight  height
0     a   34      65     160
1     b   67      98     180
2     c   23      56     172
3     d   65      43     166
4     e   51      91     180

In [282]:
data

   age  weight  height
a   34      65     160
b   67      98     180
c   23      56     172
d   65      43     166
e   51      91     180

In [284]:
data.reset_index(drop= True)

   age  weight  height
0   34      65     160
1   67      98     180
2   23      56     172
3   65      43     166
4   51      91     180

In [285]:
data

   age  weight  height
a   34      65     160
b   67      98     180
c   23      56     172
d   65      43     166
e   51      91     180

In [286]:
data.reset_index(inplace=True,drop=True)

In [287]:
data

   age  weight  height
0   34      65     160
1   67      98     180
2   23      56     172
3   65      43     166
4   51      91     180

# Set_index

In [288]:
a="engineer doctor teacher banker politics".split()
a

['engineer', 'doctor', 'teacher', 'banker', 'politics']

In [289]:
len(data)

5

In [290]:
data["profession"]=a
data

   age  weight  height profession
0   34      65     160   engineer
1   67      98     180     doctor
2   23      56     172    teacher
3   65      43     166     banker
4   51      91     180   politics

In [291]:
data.set_index("profession")

            age  weight  height
profession
engineer     34      65     160
doctor       67      98     180
teacher      23      56     172
banker       65      43     166
politics     51      91     180

# NULL VALUES

In [293]:
data=pd.DataFrame({"infected":[200,800,np.nan],"death":[80,np.nan,np.nan],"recover":[10,100,6]})

In [295]:
data

   infected  death  recover
0     200.0   80.0       10
1     800.0    NaN      100
2       NaN    NaN        6

In [296]:
index_state="Bengaluru delhi noida".split()
index_state

['Bengaluru', 'delhi', 'noida']

In [87]:
data

   infected  death  recover
0     200.0   80.0       10
1     800.0    NaN      100
2       NaN    NaN        6

In [297]:
index_state

['Bengaluru', 'delhi', 'noida']

In [298]:
data["state"]=index_state

In [299]:
data

   infected  death  recover      state
0     200.0   80.0       10  Bengaluru
1     800.0    NaN      100      delhi
2       NaN    NaN        6      noida

In [300]:
data.set_index("state",inplace=True)

In [301]:
data

           infected  death  recover
state
Bengaluru     200.0   80.0       10
delhi         800.0    NaN      100
noida           NaN    NaN        6

In [92]:
data.isnull().sum()

infected    1
death       2
recover     0
dtype: int64

In [302]:
np.where(data["death"].isnull()==True)

(array([1, 2], dtype=int64),)

In [303]:
data["death"].isnull()==True

state
Bengaluru    False
delhi         True
noida         True
Name: death, dtype: bool

In [304]:
data

           infected  death  recover
state
Bengaluru     200.0   80.0       10
delhi         800.0    NaN      100
noida           NaN    NaN        6

In [305]:
data.dropna(how="all")

           infected  death  recover
state
Bengaluru     200.0   80.0       10

In [99]:
data

           infected  death  recover
state
Bengaluru     200.0   80.0       10
delhi         800.0    NaN      100
noida           NaN    NaN        6

# FILL VALUES

In [306]:
data

           infected  death  recover
state
Bengaluru     200.0   80.0       10
delhi         800.0    NaN      100
noida           NaN    NaN        6

In [307]:
data.fillna(value="fill value")

             infected       death  recover
state
Bengaluru       200.0        80.0       10
delhi           800.0  fill value      100
noida      fill value  fill value        6

In [311]:
data

           infected  death  recover
state
Bengaluru     200.0   80.0       10
delhi         800.0    NaN      100
noida           NaN    NaN        6

In [312]:
data["infected"].mean()

500.0

In [313]:
data["death"].median()

80.0

In [314]:
data["death"].fillna(data["death"].median())

state
Bengaluru    80.0
delhi        80.0
noida        80.0
Name: death, dtype: float64

In [315]:
data1=pd.DataFrame({"company":["A","B","C","D","B","C","A",np.nan],"Person":["esh","avi","meg",np.nan,"ash","esh","meg","avi"],"sales":[200,300,400,1000,456,432,234,1009]})

In [316]:
data1

  company Person  sales
0       A    esh    200
1       B    avi    300
2       C    meg    400
3       D    NaN   1000
4       B    ash    456
5       C    esh    432
6       A    meg    234
7     NaN    avi   1009

In [318]:
data1["Person"].mode()

0    avi
1    esh
2    meg
dtype: object

In [319]:
data1["Person"].fillna(data1["Person"].mode()[0])

0    esh
1    avi
2    meg
3    avi
4    ash
5    esh
6    meg
7    avi
Name: Person, dtype: object

In [145]:
data1["Person"].mode()

0    avi
1    esh
2    meg
dtype: object

# GROUPBY

SYNTAX:- data1.groupby("cat")["numerical"]

In [320]:
data1

  company Person  sales
0       A    esh    200
1       B    avi    300
2       C    meg    400
3       D    NaN   1000
4       B    ash    456
5       C    esh    432
6       A    meg    234
7     NaN    avi   1009

In [321]:
data1.groupby("Person")["sales"].sum()

Person
ash     456
avi    1309
esh     632
meg     634
Name: sales, dtype: int64

In [322]:
data1.groupby(["company","Person"])["sales"].sum()

company  Person
A        esh       200
         meg       234
B        ash       456
         avi       300
C        esh       432
         meg       400
Name: sales, dtype: int64

In [323]:
data1.groupby("company")["sales"].describe()

         count    mean         std     min     25%     50%     75%     max
company
A          2.0   217.0   24.041631   200.0   208.5   217.0   225.5   234.0
B          2.0   378.0  110.308658   300.0   339.0   378.0   417.0   456.0
C          2.0   416.0   22.627417   400.0   408.0   416.0   424.0   432.0
D          1.0  1000.0         NaN  1000.0  1000.0  1000.0  1000.0  1000.0

In [324]:
data2=data1.groupby("company").describe()
data2

        sales
        count    mean         std     min     25%     50%     75%     max
company
A         2.0   217.0   24.041631   200.0   208.5   217.0   225.5   234.0
B         2.0   378.0  110.308658   300.0   339.0   378.0   417.0   456.0
C         2.0   416.0   22.627417   400.0   408.0   416.0   424.0   432.0
D         1.0  1000.0         NaN  1000.0  1000.0  1000.0  1000.0  1000.0

In [325]:
data3=pd.DataFrame(data2)
data3

        sales
        count    mean         std     min     25%     50%     75%     max
company
A         2.0   217.0   24.041631   200.0   208.5   217.0   225.5   234.0
B         2.0   378.0  110.308658   300.0   339.0   378.0   417.0   456.0
C         2.0   416.0   22.627417   400.0   408.0   416.0   424.0   432.0
D         1.0  1000.0         NaN  1000.0  1000.0  1000.0  1000.0  1000.0

In [326]:
data4=data3.loc["A"]
data4

sales  count      2.000000
       mean     217.000000
       std       24.041631
       min      200.000000
       25%      208.500000
       50%      217.000000
       75%      225.500000
       max      234.000000
Name: A, dtype: float64

# MERGING DATAFRAMES

In [327]:
a=pd.DataFrame({"A":["A0","A1","A2","A3"],"B":["B0","B1","B2","B3"],"C":["C0","C1","C2","C3"],"D":["D0","D1","D2","D3"]})

In [328]:
a

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [329]:
b=pd.DataFrame({"A":["A4","A5","A6","A7"],"B":["B4","B5","B6","B7"],"C":["C4","C5","C6","C7"],"D":["D4","D5","D6","D7"]},index=[4,5,6,7])

In [330]:
b

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [332]:
c=pd.DataFrame({"A":["A8","A9","A10","A11"],"B":["B8","B9","B10","B11"],"C":["C8","C9","C10","C11"],"D":["D8","D9","D10","D11"]},index=[8,9,10,11])

In [333]:
c

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [335]:
data_ct=pd.concat([a,b,c],axis=0)

In [337]:
data_ct

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [338]:
ct=pd.concat([a,b,c],axis=1)

In [339]:
ct

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

# MERGING BY COMMON KEY

In [340]:
left = pd.DataFrame({'key': ['K0', 'K9', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [341]:
left

  key   A   B
0  K0  A0  B0
1  K9  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [342]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [352]:
merge1=pd.merge(left,right,how="right",on="key")

In [353]:
merge1

  key    A    B   C   D
0  K0   A0   B0  C0  D0
1  K1  NaN  NaN  C1  D1
2  K2   A2   B2  C2  D2
3  K3   A3   B3  C3  D3

In [354]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K1', 'K0', 'K1', 'K2'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K1', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [355]:
left

  key1 key2   A   B
0   K0   K1  A0  B0
1   K0   K0  A1  B1
2   K1   K1  A2  B2
3   K2   K2  A3  B3

In [356]:
right

  key1 key2   C   D
0   K0   K1  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [357]:
merge2=pd.merge(left,right,how="outer",on=["key1","key2"])

In [363]:
merge2

  key1 key2    A    B    C    D
0   K0   K1   A0   B0   C0   D0
1   K0   K0   A1   B1  NaN  NaN
2   K1   K1   A2   B2  NaN  NaN
3   K2   K2   A3   B3  NaN  NaN
4   K1   K0  NaN  NaN   C1   D1
5   K1   K0  NaN  NaN   C2   D2
6   K2   K0  NaN  NaN   C3   D3

In [364]:
merge3=pd.merge(left,right,how="inner",on=["key1","key2"])

In [362]:
merge3

  key1 key2   A   B   C   D
0   K0   K1  A0  B0  C0  D0

In [153]:
left

  key1 key2   A   B
0   K0   K1  A0  B0
1   K0   K0  A1  B1
2   K1   K1  A2  B2
3   K2   K2  A3  B3

In [154]:
merge5=pd.merge(left,right,how="outer",on=["key1","key2"])

In [365]:
merge5

  key1 key2    A    B    C    D
0   K0   K1   A0   B0   C0   D0
1   K0   K0   A1   B1  NaN  NaN
2   K1   K1   A2   B2  NaN  NaN
3   K2   K2   A3   B3  NaN  NaN
4   K1   K0  NaN  NaN   C1   D1
5   K1   K0  NaN  NaN   C2   D2
6   K2   K0  NaN  NaN   C3   D3

In [366]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [370]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [371]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [369]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [372]:
left.join(right,how="inner")

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

In [280]:
right.join(left)

     C   D    A    B
K0  C0  D0   A0   B0
K2  C2  D2   A2   B2
K3  C3  D3  NaN  NaN

# OPERATIONS

In [161]:
def testfunc(x):
    if (x> 500):
        return (2*x)
    else:
        return (x/10)

In [373]:
df = pd.DataFrame({'col1':[1,2,3,4,5,6,7,8,9,10],
                   'col2':[444,555,666,444,333,222,666,777,666,555],
                   'col3':'aaa bb c dd eeee fff gg h iii j'.split()})
df

   col1  col2  col3
0     1   444   aaa
1     2   555    bb
2     3   666     c
3     4   444    dd
4     5   333  eeee
5     6   222   fff
6     7   666    gg
7     8   777     h
8     9   666   iii
9    10   555     j

In [377]:
df['FuncApplied'] = df["col2"].map(testfunc)
df

   col1  col2  col3  FuncApplied
0     1   444   aaa         44.4
1     2   555    bb       1110.0
2     3   666     c       1332.0
3     4   444    dd         44.4
4     5   333  eeee         33.3
5     6   222   fff         22.2
6     7   666    gg       1332.0
7     8   777     h       1554.0
8     9   666   iii       1332.0
9    10   555     j       1110.0

In [378]:
len(df["col3"][0])

3

In [167]:
df['col3length']= df["col3"].apply(len)
df

   col1  col2  col3  FuncApplied  col3length
0     1   444   aaa          0.1           3
1     2   555    bb          0.2           2
2     3   666     c          0.3           1
3     4   444    dd          0.4           2
4     5   333  eeee          0.5           4
5     6   222   fff          0.6           3
6     7   666    gg          0.7           2
7     8   777     h          0.8           1
8     9   666   iii          0.9           3
9    10   555     j          1.0           1

In [379]:
def sqrt(x):
    return (np.sqrt(x))

In [380]:
import numpy as np

In [382]:
df['FuncApplied'].apply(lambda x: np.sqrt(x))

0     6.663332
1    33.316662
2    36.496575
3     6.663332
4     5.770615
5     4.711688
6    36.496575
7    39.420807
8    36.496575
9    33.316662
Name: FuncApplied, dtype: float64

In [384]:
df['FuncApplied'].max()

1554.0

In [385]:
df['FuncApplied'].sum()

7914.3

In [386]:
df['FuncApplied'].min()

22.2

In [387]:
df['FuncApplied'].std()

661.9598847362279

In [388]:
df['FuncApplied'].var()

438190.889

In [389]:
del df['col3length']

KeyError: 'col3length'

In [391]:
df.drop(["col1","col2","col3"],axis=1)

   FuncApplied
0         44.4
1       1110.0
2       1332.0
3         44.4
4         33.3
5         22.2
6       1332.0
7       1554.0
8       1332.0
9       1110.0

In [392]:
df

   col1  col2  col3  FuncApplied
0     1   444   aaa         44.4
1     2   555    bb       1110.0
2     3   666     c       1332.0
3     4   444    dd         44.4
4     5   333  eeee         33.3
5     6   222   fff         22.2
6     7   666    gg       1332.0
7     8   777     h       1554.0
8     9   666   iii       1332.0
9    10   555     j       1110.0

In [393]:
df.sort_values(by='col2')

   col1  col2  col3  FuncApplied
5     6   222   fff         22.2
4     5   333  eeee         33.3
0     1   444   aaa         44.4
3     4   444    dd         44.4
1     2   555    bb       1110.0
9    10   555     j       1110.0
2     3   666     c       1332.0
6     7   666    gg       1332.0
8     9   666   iii       1332.0
7     8   777     h       1554.0

In [394]:
df

   col1  col2  col3  FuncApplied
0     1   444   aaa         44.4
1     2   555    bb       1110.0
2     3   666     c       1332.0
3     4   444    dd         44.4
4     5   333  eeee         33.3
5     6   222   fff         22.2
6     7   666    gg       1332.0
7     8   777     h       1554.0
8     9   666   iii       1332.0
9    10   555     j       1110.0

In [395]:
df.sort_values(by='FuncApplied',ascending=False)

   col1  col2  col3  FuncApplied
7     8   777     h       1554.0
2     3   666     c       1332.0
6     7   666    gg       1332.0
8     9   666   iii       1332.0
1     2   555    bb       1110.0
9    10   555     j       1110.0
0     1   444   aaa         44.4
3     4   444    dd         44.4
4     5   333  eeee         33.3
5     6   222   fff         22.2